tap "homebrew/bundle"
tap "homebrew/services"
tap "zegervdv/zathura"
# Message bus system, providing inter-application communication
brew "dbus"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Python code formatter
brew "black"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# GNU compiler collection
brew "gcc"
# Distributed revision control system
brew "git"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Utility for directing compilation
brew "make"
# FTP client with an advanced user interface
brew "ncftp"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Extraction utility for .zip compressed archives
brew "unzip"
# Internet file retriever
brew "wget"
# Command-line program for getting and setting the contents of the X selection
brew "xsel"
# Interface library
brew "zegervdv/zathura/girara"
# Web browser
cask "firefox"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Full TeX Live distribution without GUI applications
cask "mactex-no-gui"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# PDF reader and note-taking application
cask "skim"
# System monitor for the menu bar
cask "stats"
# Open-source code editor
cask "visual-studio-code"
vscode "equinusocio.vsc-material-theme"
vscode "equinusocio.vsc-material-theme-icons"
vscode "james-yu.latex-workshop"
vscode "magdalenalipka.tokyo-night-frameless"
vscode "mechatroner.rainbow-csv"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode.cpptools"
vscode "pkief.material-icon-theme"
