tap "homebrew/bundle"
tap "homebrew/services"
tap "zegervdv/zathura"
# Message bus system, providing inter-application communication
brew "dbus"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Python code formatter
brew "black"
# Versatile and fast Unicode/ASCII/ANSI graphics renderer
brew "chafa"
# Console Matrix
brew "cmatrix"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Apjanke's fork of the classic cowsay project
brew "cowsay"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Banner-like program prints strings as ASCII art
brew "figlet"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Infamous electronic fortune-cookie generator
brew "fortune"
# GNU compiler collection
brew "gcc"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# GNU version of the tar archiving utility
brew "gnu-tar"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Popular GNU data compression program
brew "gzip"
# Next-gen compiler infrastructure
brew "llvm"
# Utility for directing compilation
brew "make"
# FTP client with an advanced user interface
brew "ncftp"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Static type checker for Python
brew "pyright"
# Safe, concurrent, practical language
brew "rust"
# Tool to send files and directories, based on iroh
brew "sendme"
# Extraction utility for .zip compressed archives
brew "unzip"
# Internet file retriever
brew "wget"
# Command-line program for getting and setting the contents of the X selection
brew "xsel"
# Interface library
brew "zegervdv/zathura/girara"
# Web browser
cask "firefox"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Full TeX Live distribution without GUI applications
cask "mactex-no-gui"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Client for Proton Mail and Proton Calendar
cask "proton-mail"
# PDF reader and note-taking application
cask "skim"
# System monitor for the menu bar
cask "stats"
# Open-source code editor
cask "visual-studio-code"
vscode "dan-c-underwood.arm"
vscode "enkia.tokyo-night"
vscode "formulahendry.code-runner"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode.cpptools"
vscode "pkief.material-icon-theme"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
